<?php

$login_page_link = get_permalink( get_theme_mod( 'login_page' ) );
$profile_page_link = get_permalink( get_theme_mod( 'profile_page' ) );

?>

<div class="profile-control <?=is_user_logged_in() ? 'profile-control--logged-in' : ''; ?>">
    <?php if( is_user_logged_in() ) : ?>
        <a href="<?=$profile_page_link; ?>">
            <svg width="16" height="20" fill="none"><path fill-rule="evenodd" clip-rule="evenodd" d="M7.75 1.5c-1.867 0-3.333 1.453-3.333 3.188 0 1.734 1.466 3.187 3.333 3.187 1.867 0 3.333-1.453 3.333-3.188 0-1.734-1.466-3.187-3.333-3.187ZM2.917 4.688C2.917 2.072 5.107 0 7.75 0c2.643 0 4.833 2.073 4.833 4.688 0 2.614-2.19 4.687-4.833 4.687-2.643 0-4.833-2.073-4.833-4.688Zm7.5 8.03a16.383 16.383 0 0 0-5.333 0l-.208.035-.122-.74.122.74C2.949 13.07 1.5 14.798 1.5 16.86c0 .652.505 1.139 1.078 1.139h10.344c.572 0 1.078-.487 1.078-1.139 0-2.063-1.449-3.79-3.376-4.108l.122-.74-.122.74-.208-.035Zm.243-1.48-.122.74.122-.74.208.035c2.686.443 4.632 2.826 4.632 5.588 0 1.434-1.132 2.639-2.578 2.639H2.578C1.131 19.5 0 18.296 0 16.861c0-2.762 1.946-5.146 4.632-5.588l.208-.035.122.74-.122-.74a17.88 17.88 0 0 1 5.82 0Z" /></svg>
        </a>
    <?php else : ?>
        <a href="<?=$login_page_link; ?>"><?=sprintf( '%s | %s', __( 'Увійти', 'ce-crypto' ), __( 'Реєстрація', 'ce-crypto' ) ); ?></a>
    <?php endif; ?>
</div>